app/Models/ProductosModel.php

SELECT *
FROM "producto"
---
    public function getProductos(){
        return $this->findAll();

INSERT INTO "producto" ("codigo", "nombre", "descripcion", "precio") VALUES ('24456522', 'refresco', 'Grande 800 g', '85')
---
    public function GuadarProducto($prod){
        return $this->save($prod);//metodo save guarda toda la informacion en la base datos

SELECT *
FROM "producto"
WHERE "id" = '59'
 LIMIT 1
---
    public function getProducto($id){

        return $this->where('id',$id)->first($id);//buscamos el registro con el id

UPDATE "producto" SET "id" = '59', "codigo" = '6548725', "nombre" = 'Mesa mediana', "descripcion" = '4 metros largo', "precio" = '2000'
WHERE "producto"."id" IN ('59')
---
    public function ActualizarProducto($id, $prod){

        return $this->update($id, $prod);